---
title: StructuralSectionISplitSlopedFlange
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# StructuralSectionISplitSlopedFlange

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BoltDiameter { get; set; }` | `structuralSectionISplitSlopedFlange.BoltDiameter` | Double |
| `Double BoltSpacing { get; set; }` | `structuralSectionISplitSlopedFlange.BoltSpacing` | Double |
| `Double ClearWebHeight { get; set; }` | `structuralSectionISplitSlopedFlange.ClearWebHeight` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```